InformationRegisters/ТК_НастройкиТСД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ТК_НастройкиТСД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.НастройкиТСД</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТорговаяПлощадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеПлощадки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.НастройкиТСД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ТорговыеПлощадки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ТорговыеПлощадки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Global_ID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании в котором был выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GLN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Comment>Используется при анализе первичного интереса</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрироватьТК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделятьТоварыПоОрганизациям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрацияОС_ТекущиеОстатки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТерриторияПоКОАТУУ</Name>
					<Comment>Название и код территории по КОАТУУ, на которой расположен торговая точка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторКОАТУУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Comment>Номер маршрута доставки (0 если не торгует)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АссортиментнаяМатрица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АссортиментнаяМатрица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлкоголемНеТоргуем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешительныеДокументы</Name>
					<Comment>Наличие разрешительных документов по ПБ</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорСистемаАПС</Name>
					<Comment>Договор на обслуживание системы АПС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДействуетС</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Потребители</Name>
					<Comment>Потребители коммунальных услуг</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Потребитель</Name>
							<Comment>Потребитель коммунальных услуг</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПотребительКоммунальныхУслуг</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РекламныеПлоскости</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Расположение</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПлоскостьПодРекламу</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РекламныйНоситель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РекламныеНосители</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сюжет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СюжетыРекламныхНосителей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ширина</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОборудованиеПоставщиков</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Оборудование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОборудованиеПоставщиков</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерийныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоНапитков</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чай</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнвентарныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IMEI_1</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IMEI_2</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДверей</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаУстановки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВывоза</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Огнетушители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Огнетушитель</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыОгнетушителей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаТО</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСледующегоТО</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ТК_ТСД_РаботаHTTP_СервисПовтИсп/Ext/Module.bsl
Функция ПолучитьТорговуюПлощадку(UUID)Экспорт
	УстановитьПривилегированныйРежим(Истина);
	тпСсылка = Справочники.ТорговыеПлощадки.ПолучитьСсылку(Новый УникальныйИдентификатор(UUID)); 
	Возврат тпСсылка;
	
КонецФункции

Функция ПолучитьСклад(UUID)Экспорт
	
	СкладСсылка = Справочники.СкладыКомпании.ПолучитьСсылку(Новый УникальныйИдентификатор(UUID)); 
	Возврат СкладСсылка;
	
КонецФункции

Функция ПолучитьГуидСкладаТорговыйЗал(тпСсылка)Экспорт
	
	СкладСсылка = Справочники.СкладыКомпании.ОсновнойСкладТорговойПлощадки(тпСсылка);
	
	Если СкладСсылка.Пустая() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
		
	Возврат Строка(СкладСсылка.УникальныйИдентификатор());
	
КонецФункции

Функция ПолучитьСкладТорговыйЗал(тпСсылка)Экспорт
	
	СкладСсылка = Справочники.СкладыКомпании.ОсновнойСкладТорговойПлощадки(тпСсылка);

	Возврат СкладСсылка
	
КонецФункции

Функция ПолучитьСкладТНП(тпСсылка)Экспорт
	
	СкладСсылка = Справочники.СкладыКомпании.ТНПСкладТорговойПлощадки(тпСсылка);

	Возврат СкладСсылка
	
КонецФункции

Функция ПолучитьКонтрагента(ГуидКонтрагента) Экспорт
	Если ГуидКонтрагента = "null" Тогда
		Возврат Справочники.Контрагенты.ПустаяСсылка();
	Иначе
		Возврат  Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(ГуидКонтрагента)); 
	КонецЕсли;
	
КонецФункции

Функция ПолучитьМассивСкладовТорговойПлощадки(тпСсылка)Экспорт
	
	МассивОтвет = Справочники.СкладыКомпании.МассивСкладовТорговойПлощадкиТСД(тпСсылка);	
	Возврат МассивОтвет;
	
КонецФункции

Функция СкладИспользуетМРЦ(СкладСсылка)Экспорт
	
	 Возврат НЕ Справочники.СкладыКомпании.НеВестиУчетПоХарактеристикамНаСкладе(СкладСсылка);
	 
КонецФункции

Функция ПолучитьМассивТорговыхПлощадокПоРодителю(ТекТорговаяПлощадка) Экспорт 
	
	МассивОтвет = Новый Массив;
	УстановитьПривилегированныйРежим(Истина);
	
	
	Если Справочники.ПодразделенияКомпании.ЭтоАттика(ТекТорговаяПлощадка.ПодразделениеКомпании) Тогда
		
		РЦ = Справочники.ТорговыеПлощадки.ПолучитьСсылку(Новый УникальныйИдентификатор("b0855ae2-fd3e-11e3-8e10-0050568c0032"));//Распределительный центр - Харьков Аттика
		РЦ_Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РЦ,"Наименование,Global_ID");
		СтруктураТорговойПлощадки = Новый Структура("ТорговаяПлощадка, ТорговаяПлощадкаUUID", 
														Формат(РЦ_Реквизиты.Global_ID,"ЧЦ=6; ЧДЦ=0; ЧН=0; ЧГ=")+" "+РЦ_Реквизиты.Наименование, 
														"b0855ae2-fd3e-11e3-8e10-0050568c0032");	
		МассивОтвет.Добавить(СтруктураТорговойПлощадки);

	КонецЕсли;
	

	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТорговыеПлощадки.Ссылка КАК ТорговаяПлощадкаСсылка,
	               |	ПРЕДСТАВЛЕНИЕССЫЛКИ(ТорговыеПлощадки.Ссылка) КАК ТорговаяПлощадкаПредставление,
	               |	ТорговыеПлощадки.Родитель КАК Родитель,
	               |	ТорговыеПлощадки.Global_ID КАК Global_ID
	               |ИЗ
	               |	Справочник.ТорговыеПлощадки КАК ТорговыеПлощадки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТК_НастройкиТСД КАК ТК_НастройкиТСД
	               |		ПО ТорговыеПлощадки.Ссылка = ТК_НастройкиТСД.ТорговаяПлощадка
	               |			И (ТК_НастройкиТСД.Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиТСД.ЗапретНаВыборТорговойПлощадки))
	               |ГДЕ
	               |	ТорговыеПлощадки.Ссылка В ИЕРАРХИИ
	               |			(ВЫБРАТЬ
	               |				ВЫБОР
	               |					КОГДА ТорговыеПлощадки.Родитель = ЗНАЧЕНИЕ(справочник.ТорговыеПлощадки.ПустаяСсылка)
	               |						ТОГДА ТорговыеПлощадки.Ссылка
	               |					КОГДА ТорговыеПлощадки.Родитель.Родитель = ЗНАЧЕНИЕ(справочник.ТорговыеПлощадки.ПустаяСсылка)
	               |						ТОГДА ТорговыеПлощадки.Родитель
	               |					ИНАЧЕ ТорговыеПлощадки.Родитель
	               |				КОНЕЦ КАК Родитель
	               |			ИЗ
	               |				Справочник.ТорговыеПлощадки КАК ТорговыеПлощадки
	               |			ГДЕ
	               |				ТорговыеПлощадки.Ссылка = &Ссылка)
	               |	И НЕ ТорговыеПлощадки.ПометкаУдаления
	               |	И ВЫБОР
	               |			КОГДА ЕСТЬNULL(ТК_НастройкиТСД.Значение, ЛОЖЬ) = ИСТИНА
	               |				ТОГДА ЛОЖЬ
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Ссылка", ТекТорговаяПлощадка);

	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		СтруктураТорговойПлощадки = Новый Структура("ТорговаяПлощадка, ТорговаяПлощадкаUUID", 
														Формат(Выборка.Global_ID,"ЧЦ=6; ЧДЦ=0; ЧН=0; ЧГ=")+" "+Выборка.ТорговаяПлощадкаПредставление, 
														Строка(Выборка.ТорговаяПлощадкаСсылка.УникальныйИдентификатор()));	
		МассивОтвет.Добавить(СтруктураТорговойПлощадки);
	КонецЦикла;
	
	Возврат МассивОтвет;
	
КонецФункции


Функция ПолучитьПрефиксВесовогоШК()Экспорт
	Возврат 21;	
КонецФункции

Функция МассивМасокШК()Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 	"ВЫБРАТЬ
	|	МаскиШтрихКодов.Ссылка,
	|	МаскиШтрихКодов.Маска
	|ИЗ
	|	Справочник.ТК_МаскиШтрихКодовOS КАК МаскиШтрихКодов
	|ГДЕ
	|	МаскиШтрихКодов.ПометкаУдаления = ЛОЖЬ"   ;
	Рез = Запрос.Выполнить();
	Выборка = Рез.Выбрать();
	
	МассивМасок = Новый Массив;	
	Пока Выборка.Следующий() Цикл 
		
		Если Найти(Выборка.Маска,"BD")>0 Тогда
			Продолжить;
		КонецЕсли;
		СимволНачало = Найти(Выборка.Маска,":");
		Если СимволНачало = 0 Тогда
			Продолжить;
		КонецЕсли;
		СимволНачало = СимволНачало +1;
		
		ДлиннаСтроки = СтрДлина(Выборка.Маска);
		
		Если ДлиннаСтроки - (СимволНачало-1) = 16 Тогда
			ПрефНач = 1;
		Иначе
			ПрефНач = 2;
		КонецЕсли;
		

		Преф = Сред(Выборка.Маска,СимволНачало,ПрефНач);
		
		Попытка 
			ПрефЧисло = Число(Преф);
		Исключение
			Продолжить;
		КонецПопытки;
		
		чАртикул =0;
		чВес = 0;
		Для ч = СимволНачало+ПрефНач По ДлиннаСтроки Цикл 
			
			мч = Сред(Выборка.Маска,ч,1);
			Если мч = "A" Тогда
				чАртикул = чАртикул+1;
			ИначеЕсли мч = "Q" Тогда
				чВес = чВес+1;
			КонецЕсли;
			
			
		КонецЦикла;
		ДанныеМаскиШК = Новый Структура("Маска,Артикул,Вес,Преф",Выборка.Ссылка,чАртикул,чВес,Преф);
		Если МассивМасок.ВГраница()>ПрефЧисло Тогда
			МассивМасок[ПрефЧисло] =  ДанныеМаскиШК;
			Иначе
		МассивМасок.Вставить(ПрефЧисло,ДанныеМаскиШК);
		КонецЕсли;
		
		
	КонецЦикла;
	

	
	Возврат МассивМасок;
	
	
КонецФункции

Функция ПолучитьЗадачуПоГуиду(ГудЗадачи)Экспорт
	
	ЗадачаСсылка =  Задачи.ТК_ЗадачаТСД.ПолучитьСсылку(Новый УникальныйИдентификатор(ГудЗадачи)); 
	Возврат ЗадачаСсылка;
	
КонецФункции

Функция ПолучитьСотрудника(ГуидСотрудника)Экспорт
	
	СотрудникСсылка = Справочники.ФизическиеЛица.ПолучитьСсылку(Новый УникальныйИдентификатор(ГуидСотрудника));
	
	Возврат СотрудникСсылка;
		
КонецФункции


Функция ПолучитьСтатьюДДС(КодСтатьи)Экспорт
	
	СтатьяСсылка = Справочники.СтатьиДоходовИРасходов.НайтиПоКоду(КодСтатьи); 
	Возврат СтатьяСсылка;
	
КонецФункции

Функция ПолучитьТипыЦенСклада(СкладСсылка)Экспорт
	
	Структура = Новый Структура("БазовыйТипЦен,ТипЦенРеализации",Справочники.ТипыЦен.ПустаяСсылка(),Справочники.ТипыЦен.ПустаяСсылка());
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	 |	СкладыКомпанииДоступныеЦены.ТипЦен КАК ТипЦен
	 |ИЗ
	 |	Справочник.СкладыКомпании.ДоступныеЦены КАК СкладыКомпанииДоступныеЦены
	 |ГДЕ
	 |	СкладыКомпанииДоступныеЦены.Ссылка = &СкладСсылка
	 |
	 |УПОРЯДОЧИТЬ ПО
	 |	СкладыКомпанииДоступныеЦены.НомерСтроки";
	Запрос.УстановитьПараметр("СкладСсылка",СкладСсылка);
	
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Возврат Структура;
	КонецЕсли;
	
	
	Выборка = Рез.Выбрать();
	///
	
	Если Выборка.Следующий() Тогда 
		Структура.Вставить("ТипЦенРеализации",Выборка.ТипЦен);
	КонецЕсли;
	
	Если Выборка.Следующий() Тогда 
		Структура.Вставить("БазовыйТипЦен",Выборка.ТипЦен);
	КонецЕсли;
	
	 Возврат Структура;
	
	
КонецФункции

Функция ПроизовдительБАТ()Экспорт
	Возврат Справочники.ТК_Производитель.ПроизводительБАТ();
КонецФункции

Функция ПроизовдительФМ()Экспорт
	Возврат Справочники.ТК_Производитель.ПроизводительФМ();
КонецФункции
